grevaillot/svd_tools/headers/STM32F446/fmc.h
#pragma once 

/* --- FMC: Flexible memory controller ------------------------------ */

/** @defgroup fmc_registers Flexible memory controller Register
@{*/

/** FMC_BCR1 SRAM/NOR-Flash chip-select control register 1 **/
#define FMC_BCR1			MMIO32(FMC_BASE + 0x00)
/** FMC_BTR1 SRAM/NOR-Flash chip-select timing register 1 **/
#define FMC_BTR1			MMIO32(FMC_BASE + 0x04)
/** FMC_BCR2 SRAM/NOR-Flash chip-select control register 2 **/
#define FMC_BCR2			MMIO32(FMC_BASE + 0x08)
/** FMC_BTR2 SRAM/NOR-Flash chip-select timing register 2 **/
#define FMC_BTR2			MMIO32(FMC_BASE + 0x0c)
/** FMC_BCR3 SRAM/NOR-Flash chip-select control register 3 **/
#define FMC_BCR3			MMIO32(FMC_BASE + 0x10)
/** FMC_BTR3 SRAM/NOR-Flash chip-select timing register 3 **/
#define FMC_BTR3			MMIO32(FMC_BASE + 0x14)
/** FMC_BCR4 SRAM/NOR-Flash chip-select control register 4 **/
#define FMC_BCR4			MMIO32(FMC_BASE + 0x18)
/** FMC_BTR4 SRAM/NOR-Flash chip-select timing register 4 **/
#define FMC_BTR4			MMIO32(FMC_BASE + 0x1c)
/** FMC_PCR2 PC Card/NAND Flash control register 2 **/
#define FMC_PCR2			MMIO32(FMC_BASE + 0x60)
/** FMC_SR2 FIFO status and interrupt register 2 **/
#define FMC_SR2			MMIO32(FMC_BASE + 0x64)
/** FMC_PMEM2 Common memory space timing register 2 **/
#define FMC_PMEM2			MMIO32(FMC_BASE + 0x68)
/** FMC_PATT2 Attribute memory space timing register 2 **/
#define FMC_PATT2			MMIO32(FMC_BASE + 0x6c)
/** FMC_ECCR2 ECC result register 2 **/
#define FMC_ECCR2			MMIO32(FMC_BASE + 0x74)
/** FMC_PCR3 PC Card/NAND Flash control register 3 **/
#define FMC_PCR3			MMIO32(FMC_BASE + 0x80)
/** FMC_SR3 FIFO status and interrupt register 3 **/
#define FMC_SR3			MMIO32(FMC_BASE + 0x84)
/** FMC_PMEM3 Common memory space timing register 3 **/
#define FMC_PMEM3			MMIO32(FMC_BASE + 0x88)
/** FMC_PATT3 Attribute memory space timing register 3 **/
#define FMC_PATT3			MMIO32(FMC_BASE + 0x8c)
/** FMC_ECCR3 ECC result register 3 **/
#define FMC_ECCR3			MMIO32(FMC_BASE + 0x94)
/** FMC_PCR4 PC Card/NAND Flash control register 4 **/
#define FMC_PCR4			MMIO32(FMC_BASE + 0xa0)
/** FMC_SR4 FIFO status and interrupt register 4 **/
#define FMC_SR4			MMIO32(FMC_BASE + 0xa4)
/** FMC_PMEM4 Common memory space timing register 4 **/
#define FMC_PMEM4			MMIO32(FMC_BASE + 0xa8)
/** FMC_PATT4 Attribute memory space timing register 4 **/
#define FMC_PATT4			MMIO32(FMC_BASE + 0xac)
/** FMC_PIO4 I/O space timing register 4 **/
#define FMC_PIO4			MMIO32(FMC_BASE + 0xb0)
/** FMC_BWTR1 SRAM/NOR-Flash write timing registers 1 **/
#define FMC_BWTR1			MMIO32(FMC_BASE + 0x104)
/** FMC_BWTR2 SRAM/NOR-Flash write timing registers 2 **/
#define FMC_BWTR2			MMIO32(FMC_BASE + 0x10c)
/** FMC_BWTR3 SRAM/NOR-Flash write timing registers 3 **/
#define FMC_BWTR3			MMIO32(FMC_BASE + 0x114)
/** FMC_BWTR4 SRAM/NOR-Flash write timing registers 4 **/
#define FMC_BWTR4			MMIO32(FMC_BASE + 0x11c)
/** FMC_SDCR1 SDRAM Control Register 1 **/
#define FMC_SDCR1			MMIO32(FMC_BASE + 0x140)
/** FMC_SDCR2 SDRAM Control Register 2 **/
#define FMC_SDCR2			MMIO32(FMC_BASE + 0x144)
/** FMC_SDTR1 SDRAM Timing register 1 **/
#define FMC_SDTR1			MMIO32(FMC_BASE + 0x148)
/** FMC_SDTR2 SDRAM Timing register 2 **/
#define FMC_SDTR2			MMIO32(FMC_BASE + 0x14c)
/** FMC_SDCMR SDRAM Command Mode register **/
#define FMC_SDCMR			MMIO32(FMC_BASE + 0x150)
/** FMC_SDRTR SDRAM Refresh Timer register **/
#define FMC_SDRTR			MMIO32(FMC_BASE + 0x154)
/** FMC_SDSR SDRAM Status register **/
#define FMC_SDSR			MMIO32(FMC_BASE + 0x158)

/**@}*/


/** @defgroup fmc_bcr1 BCR1 SRAM/NOR-Flash chip-select control register 1
@{*/

/** FMC_BCR1_CCLKEN CCLKEN **/
#define FMC_BCR1_CCLKEN		(1 << 20)
/** FMC_BCR1_CBURSTRW CBURSTRW **/
#define FMC_BCR1_CBURSTRW		(1 << 19)
/** FMC_BCR1_ASYNCWAIT ASYNCWAIT **/
#define FMC_BCR1_ASYNCWAIT		(1 << 15)
/** FMC_BCR1_EXTMOD EXTMOD **/
#define FMC_BCR1_EXTMOD		(1 << 14)
/** FMC_BCR1_WAITEN WAITEN **/
#define FMC_BCR1_WAITEN		(1 << 13)
/** FMC_BCR1_WREN WREN **/
#define FMC_BCR1_WREN		(1 << 12)
/** FMC_BCR1_WAITCFG WAITCFG **/
#define FMC_BCR1_WAITCFG		(1 << 11)
/** FMC_BCR1_WAITPOL WAITPOL **/
#define FMC_BCR1_WAITPOL		(1 << 9)
/** FMC_BCR1_BURSTEN BURSTEN **/
#define FMC_BCR1_BURSTEN		(1 << 8)
/** FMC_BCR1_FACCEN FACCEN **/
#define FMC_BCR1_FACCEN		(1 << 6)

#define FMC_BCR1_MWID_SHIFT		4
#define FMC_BCR1_MWID_MASK		0x03
/** @defgroup fmc_bcr1_mwid MWID MWID
@{*/
/**@}*/


#define FMC_BCR1_MTYP_SHIFT		2
#define FMC_BCR1_MTYP_MASK		0x03
/** @defgroup fmc_bcr1_mtyp MTYP MTYP
@{*/
/**@}*/

/** FMC_BCR1_MUXEN MUXEN **/
#define FMC_BCR1_MUXEN		(1 << 1)
/** FMC_BCR1_MBKEN MBKEN **/
#define FMC_BCR1_MBKEN		(1 << 0)

/**@}*/

/** @defgroup fmc_btr1 BTR1 SRAM/NOR-Flash chip-select timing register 1
@{*/


#define FMC_BTR1_ACCMOD_SHIFT		28
#define FMC_BTR1_ACCMOD_MASK		0x03
/** @defgroup fmc_btr1_accmod ACCMOD ACCMOD
@{*/
/**@}*/


#define FMC_BTR1_DATLAT_SHIFT		24
#define FMC_BTR1_DATLAT_MASK		0x0f
/** @defgroup fmc_btr1_datlat DATLAT DATLAT
@{*/
/**@}*/


#define FMC_BTR1_CLKDIV_SHIFT		20
#define FMC_BTR1_CLKDIV_MASK		0x0f
/** @defgroup fmc_btr1_clkdiv CLKDIV CLKDIV
@{*/
/**@}*/


#define FMC_BTR1_BUSTURN_SHIFT		16
#define FMC_BTR1_BUSTURN_MASK		0x0f
/** @defgroup fmc_btr1_busturn BUSTURN BUSTURN
@{*/
/**@}*/


#define FMC_BTR1_DATAST_SHIFT		8
#define FMC_BTR1_DATAST_MASK		0xff
/** @defgroup fmc_btr1_datast DATAST DATAST
@{*/
/**@}*/


#define FMC_BTR1_ADDHLD_SHIFT		4
#define FMC_BTR1_ADDHLD_MASK		0x0f
/** @defgroup fmc_btr1_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FMC_BTR1_ADDSET_SHIFT		0
#define FMC_BTR1_ADDSET_MASK		0x0f
/** @defgroup fmc_btr1_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_bcr2 BCR2 SRAM/NOR-Flash chip-select control register 2
@{*/

/** FMC_BCR2_CBURSTRW CBURSTRW **/
#define FMC_BCR2_CBURSTRW		(1 << 19)
/** FMC_BCR2_ASYNCWAIT ASYNCWAIT **/
#define FMC_BCR2_ASYNCWAIT		(1 << 15)
/** FMC_BCR2_EXTMOD EXTMOD **/
#define FMC_BCR2_EXTMOD		(1 << 14)
/** FMC_BCR2_WAITEN WAITEN **/
#define FMC_BCR2_WAITEN		(1 << 13)
/** FMC_BCR2_WREN WREN **/
#define FMC_BCR2_WREN		(1 << 12)
/** FMC_BCR2_WAITCFG WAITCFG **/
#define FMC_BCR2_WAITCFG		(1 << 11)
/** FMC_BCR2_WRAPMOD WRAPMOD **/
#define FMC_BCR2_WRAPMOD		(1 << 10)
/** FMC_BCR2_WAITPOL WAITPOL **/
#define FMC_BCR2_WAITPOL		(1 << 9)
/** FMC_BCR2_BURSTEN BURSTEN **/
#define FMC_BCR2_BURSTEN		(1 << 8)
/** FMC_BCR2_FACCEN FACCEN **/
#define FMC_BCR2_FACCEN		(1 << 6)

